; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v12 ?v13)
             (pred_9 ?v8 ?v2)
             (pred_5 ?v12 ?v2)
             (pred_6 ?v10 ?v12 )
	     (pred_3 ?v12)
             (pred_1 ?v6)
             (pred_10 ?v8)
             (pred_8 ?v2)
             (pred_12 ?v12)
             (pred_11 ?v8)
             (pred_7 ?v12)
             (pred_2 ))



(:action op_4
:parameters (?v7 ?v3 ?v9 ?v4)
:precondition (and (pred_1 ?v7) (pred_1 ?v3) (pred_10 ?v9) (pred_8 ?v4)
          (pred_4 ?v7 ?v3) (pred_9 ?v9 ?v4)
                   (pred_5 ?v3 ?v4) (pred_3 ?v7) 
                   (pred_12 ?v3) (pred_11 ?v9))
:effect (and  (pred_7 ?v3) (not (pred_12 ?v3))))


(:action op_5
:parameters (?v7 ?v1)
:precondition (and (pred_1 ?v7) (pred_1 ?v1)
               (pred_3 ?v7) (pred_4 ?v7 ?v1) (pred_7 ?v1))
:effect (and (pred_3 ?v1) (not (pred_3 ?v7))))

(:action op_2
:parameters (?v7 ?v9)
:precondition (and (pred_1 ?v7) (pred_10 ?v9) 
                  (pred_3 ?v7) (pred_6 ?v9 ?v7) (pred_2 ))
:effect (and (pred_11 ?v9)
   (not (pred_6 ?v9 ?v7)) (not (pred_2 ))))


(:action op_3
:parameters (?v7 ?v11 ?v5)
:precondition (and (pred_1 ?v7) (pred_10 ?v11) (pred_10 ?v5)
                  (pred_3 ?v7) (pred_11 ?v5) (pred_6 ?v11 ?v7))
:effect (and (pred_11 ?v11) (pred_6 ?v5 ?v7)
        (not (pred_11 ?v5)) (not (pred_6 ?v11 ?v7))))

(:action op_1
:parameters (?v7 ?v9)
:precondition (and (pred_1 ?v7) (pred_10 ?v9) 
                  (pred_3 ?v7) (pred_11 ?v9))
:effect (and (pred_2 ) (pred_6 ?v9 ?v7) (not (pred_11 ?v9)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_27 obj_10 obj_24 obj_01 obj_32 obj_04 obj_21 obj_30 obj_20 obj_16 obj_03 obj_09 obj_13 obj_14 obj_18 obj_05 obj_19 obj_17 obj_31 obj_11 obj_06 obj_15 obj_08 obj_26 obj_22
    obj_28 obj_07 obj_25
    obj_29 obj_23 obj_12 obj_02
    )

    (:init
       (pred_2)

       (pred_1 obj_27)
       (pred_1 obj_10)
       (pred_1 obj_24)
       (pred_1 obj_01)
       (pred_1 obj_32)
       (pred_1 obj_04)
       (pred_1 obj_21)
       (pred_1 obj_30)
       (pred_1 obj_20)
       (pred_1 obj_16)
       (pred_1 obj_03)
       (pred_1 obj_09)
       (pred_1 obj_13)
       (pred_1 obj_14)
       (pred_1 obj_18)
       (pred_1 obj_05)
       (pred_1 obj_19)
       (pred_1 obj_17)
       (pred_1 obj_31)
       (pred_1 obj_11)
       (pred_1 obj_06)
       (pred_1 obj_15)
       (pred_1 obj_08)
       (pred_1 obj_26)
       (pred_1 obj_22)
       (pred_8 obj_28)
       (pred_8 obj_07)
       (pred_8 obj_25)
       (pred_10 obj_29)
       (pred_10 obj_23)
       (pred_10 obj_12)
       (pred_10 obj_02)

       (pred_4 obj_27 obj_04)
       (pred_4 obj_27 obj_10)
       (pred_4 obj_10 obj_21)
       (pred_4 obj_10 obj_24)
       (pred_4 obj_10 obj_27)
       (pred_4 obj_24 obj_30)
       (pred_4 obj_24 obj_01)
       (pred_4 obj_24 obj_10)
       (pred_4 obj_01 obj_20)
       (pred_4 obj_01 obj_32)
       (pred_4 obj_01 obj_24)
       (pred_4 obj_32 obj_16)
       (pred_4 obj_32 obj_01)
       (pred_4 obj_04 obj_03)
       (pred_4 obj_04 obj_21)
       (pred_4 obj_04 obj_27)
       (pred_4 obj_21 obj_09)
       (pred_4 obj_21 obj_30)
       (pred_4 obj_21 obj_10)
       (pred_4 obj_21 obj_04)
       (pred_4 obj_30 obj_13)
       (pred_4 obj_30 obj_20)
       (pred_4 obj_30 obj_24)
       (pred_4 obj_30 obj_21)
       (pred_4 obj_20 obj_14)
       (pred_4 obj_20 obj_16)
       (pred_4 obj_20 obj_01)
       (pred_4 obj_20 obj_30)
       (pred_4 obj_16 obj_18)
       (pred_4 obj_16 obj_32)
       (pred_4 obj_16 obj_20)
       (pred_4 obj_03 obj_05)
       (pred_4 obj_03 obj_09)
       (pred_4 obj_03 obj_04)
       (pred_4 obj_09 obj_19)
       (pred_4 obj_09 obj_13)
       (pred_4 obj_09 obj_21)
       (pred_4 obj_09 obj_03)
       (pred_4 obj_13 obj_17)
       (pred_4 obj_13 obj_14)
       (pred_4 obj_13 obj_30)
       (pred_4 obj_13 obj_09)
       (pred_4 obj_14 obj_31)
       (pred_4 obj_14 obj_18)
       (pred_4 obj_14 obj_20)
       (pred_4 obj_14 obj_13)
       (pred_4 obj_18 obj_11)
       (pred_4 obj_18 obj_16)
       (pred_4 obj_18 obj_14)
       (pred_4 obj_05 obj_06)
       (pred_4 obj_05 obj_19)
       (pred_4 obj_05 obj_03)
       (pred_4 obj_19 obj_15)
       (pred_4 obj_19 obj_17)
       (pred_4 obj_19 obj_09)
       (pred_4 obj_19 obj_05)
       (pred_4 obj_17 obj_08)
       (pred_4 obj_17 obj_31)
       (pred_4 obj_17 obj_13)
       (pred_4 obj_17 obj_19)
       (pred_4 obj_31 obj_26)
       (pred_4 obj_31 obj_11)
       (pred_4 obj_31 obj_14)
       (pred_4 obj_31 obj_17)
       (pred_4 obj_11 obj_22)
       (pred_4 obj_11 obj_18)
       (pred_4 obj_11 obj_31)
       (pred_4 obj_06 obj_15)
       (pred_4 obj_06 obj_05)
       (pred_4 obj_15 obj_08)
       (pred_4 obj_15 obj_19)
       (pred_4 obj_15 obj_06)
       (pred_4 obj_08 obj_26)
       (pred_4 obj_08 obj_17)
       (pred_4 obj_08 obj_15)
       (pred_4 obj_26 obj_22)
       (pred_4 obj_26 obj_31)
       (pred_4 obj_26 obj_08)
       (pred_4 obj_22 obj_11)
       (pred_4 obj_22 obj_26)
       (pred_12 obj_24)
       (pred_12 obj_15)
       (pred_12 obj_30)
       (pred_12 obj_18)
       (pred_5  obj_24 obj_28)
       (pred_5  obj_15 obj_07)
       (pred_5  obj_30 obj_25)
       (pred_5  obj_18 obj_25)
       (pred_7 obj_27)
       (pred_7 obj_10)
       (pred_7 obj_01)
       (pred_7 obj_32)
       (pred_7 obj_04)
       (pred_7 obj_21)
       (pred_7 obj_20)
       (pred_7 obj_16)
       (pred_7 obj_03)
       (pred_7 obj_09)
       (pred_7 obj_13)
       (pred_7 obj_14)
       (pred_7 obj_05)
       (pred_7 obj_19)
       (pred_7 obj_17)
       (pred_7 obj_31)
       (pred_7 obj_11)
       (pred_7 obj_06)
       (pred_7 obj_08)
       (pred_7 obj_26)
       (pred_7 obj_22)

       (pred_9  obj_29 obj_28)
       (pred_9  obj_23 obj_07)
       (pred_9  obj_12 obj_25)
       (pred_9  obj_02 obj_28)
       (pred_6 obj_29 obj_17)
       (pred_6 obj_23 obj_16)
       (pred_6 obj_12 obj_08)
       (pred_6 obj_02 obj_10)
       (pred_3 obj_31)
    )

    (:goal (and
       (pred_6 obj_29 obj_10)
       (pred_6 obj_23 obj_01)
       (pred_6 obj_12 obj_26)
       (pred_6 obj_02 obj_24)
    ))
(:constraints
  (always (not (pred_3 obj_32)))
)
)

; plan
1. (op_5 obj_31 obj_17)
   deleted: (pred_3 obj_31)
   added: (pred_3 obj_17)
   goals met: 0 of 4
2. (op_2 obj_17 obj_29)
   deleted: (pred_6 obj_29 obj_17) (pred_2)
   added: (pred_11 obj_29)
   goals met: 0 of 4
3. (op_5 obj_17 obj_13)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_13)
   goals met: 0 of 4
4. (op_5 obj_13 obj_09)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_09)
   goals met: 0 of 4
5. (op_5 obj_09 obj_21)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_21)
   goals met: 0 of 4
6. (op_5 obj_21 obj_10)
   deleted: (pred_3 obj_21)
   added: (pred_3 obj_10)
   goals met: 0 of 4
7. (op_4 obj_10 obj_24 obj_29 obj_28)
   deleted: (pred_12 obj_24)
   added: (pred_7 obj_24)
   goals met: 0 of 4
8. (op_3 obj_10 obj_02 obj_29)
   deleted: (pred_11 obj_29) (pred_6 obj_02 obj_10)
   added: (pred_11 obj_02) (pred_6 obj_29 obj_10)
   goals met: 1 of 4
9. (op_5 obj_10 obj_21)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_21)
   goals met: 1 of 4
10. (op_5 obj_21 obj_09)
   deleted: (pred_3 obj_21)
   added: (pred_3 obj_09)
   goals met: 1 of 4
11. (op_5 obj_09 obj_13)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_13)
   goals met: 1 of 4
12. (op_5 obj_13 obj_14)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_14)
   goals met: 1 of 4
13. (op_5 obj_14 obj_31)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_31)
   goals met: 1 of 4
14. (op_5 obj_31 obj_26)
   deleted: (pred_3 obj_31)
   added: (pred_3 obj_26)
   goals met: 1 of 4
15. (op_1 obj_26 obj_02)
   deleted: (pred_11 obj_02)
   added: (pred_2) (pred_6 obj_02 obj_26)
   goals met: 1 of 4
16. (op_5 obj_26 obj_08)
   deleted: (pred_3 obj_26)
   added: (pred_3 obj_08)
   goals met: 1 of 4
17. (op_2 obj_08 obj_12)
   deleted: (pred_6 obj_12 obj_08) (pred_2)
   added: (pred_11 obj_12)
   goals met: 1 of 4
18. (op_5 obj_08 obj_26)
   deleted: (pred_3 obj_08)
   added: (pred_3 obj_26)
   goals met: 1 of 4
19. (op_3 obj_26 obj_02 obj_12)
   deleted: (pred_11 obj_12) (pred_6 obj_02 obj_26)
   added: (pred_11 obj_02) (pred_6 obj_12 obj_26)
   goals met: 2 of 4
20. (op_5 obj_26 obj_31)
   deleted: (pred_3 obj_26)
   added: (pred_3 obj_31)
   goals met: 2 of 4
21. (op_5 obj_31 obj_14)
   deleted: (pred_3 obj_31)
   added: (pred_3 obj_14)
   goals met: 2 of 4
22. (op_5 obj_14 obj_20)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_20)
   goals met: 2 of 4
23. (op_5 obj_20 obj_16)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_16)
   goals met: 2 of 4
24. (op_3 obj_16 obj_23 obj_02)
   deleted: (pred_11 obj_02) (pred_6 obj_23 obj_16)
   added: (pred_11 obj_23) (pred_6 obj_02 obj_16)
   goals met: 2 of 4
25. (op_5 obj_16 obj_20)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_20)
   goals met: 2 of 4
26. (op_5 obj_20 obj_01)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_01)
   goals met: 2 of 4
27. (op_1 obj_01 obj_23)
   deleted: (pred_11 obj_23)
   added: (pred_2) (pred_6 obj_23 obj_01)
   goals met: 3 of 4
28. (op_5 obj_01 obj_20)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_20)
   goals met: 3 of 4
29. (op_5 obj_20 obj_16)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_16)
   goals met: 3 of 4
30. (op_2 obj_16 obj_02)
   deleted: (pred_6 obj_02 obj_16) (pred_2)
   added: (pred_11 obj_02)
   goals met: 3 of 4
31. (op_5 obj_16 obj_20)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_20)
   goals met: 3 of 4
32. (op_5 obj_20 obj_01)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_01)
   goals met: 3 of 4
33. (op_5 obj_01 obj_24)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_24)
   goals met: 3 of 4
34. (op_1 obj_24 obj_02)
   deleted: (pred_11 obj_02)
   added: (pred_2) (pred_6 obj_02 obj_24)
   goals met: 4 of 4
